In [1]:

import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
dat1 = pd.read_csv("3rd_ppp_for_upload_win.csv", encoding = "ISO-8859-1")
dat2 = pd.read_csv("atm_for_upload_win.csv", encoding = "ISO-8859-1")
dat3 = pd.read_csv("banks_for_upload_win.csv", encoding = "ISO-8859-1")
dat4 = pd.read_csv("bus_stands_for_upload_win.csv", encoding = "ISO-8859-1")
dat5 = pd.read_csv("microfinance_for_upload_win.csv", encoding = "ISO-8859-1")
dat6 = pd.read_csv("mobilemoney_agents_for_upload_win.csv", encoding = "ISO-8859-1")
dat7 = pd.read_csv("pos_for_upload_win.csv", encoding = "ISO-8859-1")
dat8 = pd.read_csv("post_office_for_upload_win.csv", encoding = "ISO-8859-1")
dat9 = pd.read_csv("sacco_for_upload_win.csv", encoding = "ISO-8859-1")

C:\Users\dell\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3057: DtypeWarning: Columns (26,32,33,42,74) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
dat1 = dat1[['region', 'district', 'ward', 'latitude', 'longitude']]
dat2 = dat2[['region', 'district', 'ward', 'latitude', 'longitude']]
dat3 = dat3[['region', 'district', 'ward', 'latitude', 'longitude']]
dat4 = dat4[['region', 'district', 'ward', 'latitude', 'longitude']]
dat5 = dat5[['region', 'district', 'ward', 'latitude', 'longitude']]
dat6 = dat6[['region', 'district', 'ward', 'latitude', 'longitude']]
dat7 = dat7[['region', 'district', 'ward', 'latitude', 'longitude']]
dat8 = dat8[['region', 'district', 'ward', 'latitude', 'longitude']]
dat9 = dat9[['region', 'district', 'ward', 'latitude', 'longitude']]

In [4]:
data = pd.concat([dat1,dat2,dat3,dat4,dat5,dat6,dat7,dat8,dat9])

In [5]:
data.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [6]:
data.isnull().sum()

region       20
district     19
ward         19
latitude      0
longitude     0
dtype: int64

In [7]:
data.dropna(inplace = True)

In [8]:
data.reset_index(inplace = True)

In [9]:
data.drop("index", axis = 1 ,inplace = True)

In [10]:
data.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [11]:
dataOriginal = data.copy()

In [12]:
data['region'] = data['region'].astype('category')

In [13]:
data.nunique()

region          22
district       124
ward          1383
latitude     40399
longitude    41000
dtype: int64

In [14]:
data.drop_duplicates(inplace =True)
data.reset_index(inplace = True)
data.drop("index", axis = 1 ,inplace = True)

In [15]:
data.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [16]:
data[data["latitude"] == -2.36921]

   region district      ward  latitude  longitude
0  Mwanza     Magu  Nyanguge  -2.36921   33.57654

In [17]:
cat_columns = data.select_dtypes(['category']).columns

cat_columns
data[cat_columns] = data[cat_columns].apply(lambda x: x.cat.codes)
data.head()

   region   district         ward  latitude  longitude
0      13       Magu     Nyanguge  -2.36921   33.57654
1      13    Ilemela      Nyakato  -2.53201   32.94780
2       1      Ilala      Segerea  -6.84188   39.21102
3       1  Kinondoni  Kijitonyama  -6.77949   39.24092
4       1     Temeke    Kigamboni  -6.82792   39.31021

In [18]:
data.region.nunique()

22

In [19]:
X= data.drop(["district","region","ward"], axis =1)
y = data['region']

In [20]:
X.head()

   latitude  longitude
0  -2.36921   33.57654
1  -2.53201   32.94780
2  -6.84188   39.21102
3  -6.77949   39.24092
4  -6.82792   39.31021

In [21]:
y.head()

0    13
1    13
2     1
3     1
4     1
Name: region, dtype: int8

In [22]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.3, random_state=42)

In [23]:
from xgboost import XGBClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier

In [24]:

model = LogisticRegression()
rf = RandomForestClassifier()
xgb = XGBClassifier(max_depth=5, 
                    learning_rate=0.2, 
                    )

In [25]:
X_train.head()

       latitude  longitude
49627  -6.80937   37.69184
39556  -3.82783   32.59622
11248  -4.18991   35.02281
27827  -6.76761   39.21725
10709  -7.36417   39.06662

In [26]:
y_train.head()

49627    11
39556    17
11248     8
27827     1
10709    14
Name: region, dtype: int8

In [27]:
model1=xgb.fit(X_train,y_train)

In [30]:
model2=rf.fit(X_train,y_train)

In [31]:
model1.predict(X_test)

array([ 1,  1,  1, ...,  1, 20,  0], dtype=int8)

In [32]:
from sklearn.metrics import accuracy_score

In [33]:
accuracy_score(model1.predict(X_test),y_test)

0.9884213667561922

In [34]:
accuracy_score(rf.predict(X_test),y_test)

0.9888391524917935

In [35]:
dataOriginal.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [36]:
dataOriginal.head()
dataOriginal[dataOriginal['region']=='Mwanza']



dataOriginal['region'] = dataOriginal['region'].astype('category')

dataOriginal.drop_duplicates(inplace =True)
dataOriginal.reset_index(inplace = True)
dataOriginal.drop("index", axis = 1 ,inplace = True)
dist = dataOriginal["region"]
cat_columns = dataOriginal.select_dtypes(['category']).columns

cat_columns
dataOriginal[cat_columns] = dataOriginal[cat_columns].apply(lambda x: x.cat.codes)
dataOriginal.head()

   region   district         ward  latitude  longitude
0      13       Magu     Nyanguge  -2.36921   33.57654
1      13    Ilemela      Nyakato  -2.53201   32.94780
2       1      Ilala      Segerea  -6.84188   39.21102
3       1  Kinondoni  Kijitonyama  -6.77949   39.24092
4       1     Temeke    Kigamboni  -6.82792   39.31021

In [37]:
worked_out = pd.concat([dataOriginal["region"],dist],axis =1)

In [38]:
dist

0               Mwanza
1               Mwanza
2        Dar es Salaam
3        Dar es Salaam
4        Dar es Salaam
5        Dar es Salaam
6        Dar es Salaam
7        Dar es Salaam
8        Dar es Salaam
9        Dar es Salaam
10              Arusha
11               Pwani
12       Dar es Salaam
13              Tabora
14       Dar es Salaam
15       Dar es Salaam
16       Dar es Salaam
17               Lindi
18       Dar es Salaam
19               Lindi
20       Dar es Salaam
21       Dar es Salaam
22       Dar es Salaam
23       Dar es Salaam
24       Dar es Salaam
25               Lindi
26       Dar es Salaam
27       Dar es Salaam
28       Dar es Salaam
29       Dar es Salaam
             ...
55820            Mbeya
55821            Mbeya
55822            Mbeya
55823      Kilimanjaro
55824        Shinyanga
55825          Manyara
55826      Kilimanjaro
55827           Tabora
55828           Tabora
55829    Dar es Salaam
55830           Tabora
55831            Mbeya
55832           Tabora
55833      Kilimanjaro
55834           Arusha
55835           Tabora
55836           Tabora
55837           Arusha
55838           Arusha
55839           Tabora
55840           Tabora
55841          Manyara
55842           Dodoma
55843      Kilimanjaro
55844      Kilimanjaro
55845      Kilimanjaro
55846           Tabora
55847             Mara
55848           Ruvuma
55849           Tabora
Name: region, Length: 55850, dtype: category
Categories (22, object): [Arusha, Dar es Salaam, Dodoma, Iringa, ..., Singida, Tabora, Tanga, Zanzibar]

In [39]:
worked_out.columns = ["region",'main']

In [40]:
train = pd.read_csv("disttrain.csv")

In [41]:
test = pd.read_csv("disttest.csv")

In [42]:
train.head()

,ID,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8_1,Q8_2,...,Q18,Q19,Latitude,Longitude,mobile_money,savings,borrowing,insurance,mobile_money_classification,district
0,5086,98,2,3,1,1,2,2,0,0,...,4,4,-4.460442,29.811396,0,0,0,0,0,Kasulu
1,1258,40,1,1,3,5,1,1,1,0,...,1,4,-6.176438,39.244871,1,1,1,0,3,Zanzibar
2,331,18,2,4,6,3,2,1,0,0,...,1,1,-6.825702,37.652798,1,0,0,0,2,Morogoro Urban
3,6729,50,1,1,3,1,1,1,0,0,...,1,4,-3.372049,35.808307,1,0,1,0,3,Karatu
4,8671,34,1,1,1,1,2,1,0,1,...,1,4,-7.179645,31.039095,1,1,0,1,3,Mpanda

In [43]:
train = train[['Latitude','Longitude']]
test = test[['Latitude','Longitude']]
train.columns = ['latitude', 'longitude']
test.columns  = ['latitude', 'longitude']

In [53]:
train_region = xgb.predict(train)

In [54]:
test_region = xgb.predict(test)

In [55]:
trainpred = pd.DataFrame(train_region,columns=["region"])

In [56]:
testpred = pd.DataFrame(test_region,columns=["region"])

In [57]:
dick = dict(zip(worked_out.region, worked_out.main))
dick

{13: 'Mwanza',
 1: 'Dar es Salaam',
 0: 'Arusha',
 14: 'Pwani',
 19: 'Tabora',
 7: 'Lindi',
 18: 'Singida',
 6: 'Kilimanjaro',
 2: 'Dodoma',
 11: 'Morogoro',
 3: 'Iringa',
 8: 'Manyara',
 12: 'Mtwara',
 20: 'Tanga',
 10: 'Mbeya',
 5: 'Kigoma',
 17: 'Shinyanga',
 9: 'Mara',
 16: 'Ruvuma',
 4: 'Kagera',
 21: 'Zanzibar',
 15: 'Rukwa'}

In [58]:
trainpred = trainpred.replace({"region": dick})

In [59]:
testpred = testpred.replace({"region": dick})

In [60]:
trainpred.head()

     region
0    Kigoma
1  Zanzibar
2  Morogoro
3    Arusha
4     Rukwa

In [61]:
testpred['region']

0              Mwanza
1                Mara
2              Kagera
3                Mara
4              Iringa
5             Singida
6              Iringa
7              Mwanza
8            Zanzibar
9             Singida
10               Mara
11             Kigoma
12              Rukwa
13               Mara
14              Rukwa
15      Dar es Salaam
16              Rukwa
17            Singida
18             Mwanza
19              Rukwa
20        Kilimanjaro
21              Mbeya
22             Tabora
23        Kilimanjaro
24             Mwanza
25        Kilimanjaro
26              Mbeya
27              Mbeya
28             Kagera
29               Mara
            ...
2335           Kagera
2336      Kilimanjaro
2337           Arusha
2338         Zanzibar
2339         Zanzibar
2340         Zanzibar
2341            Pwani
2342        Shinyanga
2343            Tanga
2344            Tanga
2345           Kigoma
2346         Zanzibar
2347           Mwanza
2348          Singida
2349          Singida
2350        Shinyanga
2351           Mwanza
2352        Shinyanga
2353           Mwanza
2354            Mbeya
2355            Rukwa
2356           Mwanza
2357        Shinyanga
2358            Mbeya
2359           Mwanza
2360           Mwanza
2361        Shinyanga
2362        Shinyanga
2363             Mara
2364           Mwanza
Name: region, Length: 2365, dtype: object

In [62]:
train=pd.read_csv('disttrain.csv')

In [63]:
train.head()

,ID,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8_1,Q8_2,...,Q18,Q19,Latitude,Longitude,mobile_money,savings,borrowing,insurance,mobile_money_classification,district
0,5086,98,2,3,1,1,2,2,0,0,...,4,4,-4.460442,29.811396,0,0,0,0,0,Kasulu
1,1258,40,1,1,3,5,1,1,1,0,...,1,4,-6.176438,39.244871,1,1,1,0,3,Zanzibar
2,331,18,2,4,6,3,2,1,0,0,...,1,1,-6.825702,37.652798,1,0,0,0,2,Morogoro Urban
3,6729,50,1,1,3,1,1,1,0,0,...,1,4,-3.372049,35.808307,1,0,1,0,3,Karatu
4,8671,34,1,1,1,1,2,1,0,1,...,1,4,-7.179645,31.039095,1,1,0,1,3,Mpanda

In [64]:
test=pd.read_csv('disttest.csv')

In [65]:
train['region']=trainpred['region']

In [66]:
test['region']=testpred['region']

In [67]:
train.to_csv("regiontrain.csv",index= False)

In [68]:
test.to_csv("regiontest.csv",index= False)